
** Brands
  #+begin_src bash :results output
    curl -XGET -H "Content-type: application/json" 'http://localhost:3000/brands'
  #+end_src

  #+RESULTS:

  #+begin_src bash :results output
    curl -XPOST -H "Content-type: application/json" 'http://localhost:3000/brands' \
    -d '{
      "name": "abc"
    }'
  #+end_src

  #+RESULTS:
  : {"id":3,"name":"abc","ean_prefix":null,"created_at":"2023-02-09T00:49:56.005Z","updated_at":"2023-02-09T00:49:56.005Z"}

** Purchases
  #+begin_src bash :results output
    curl -XGET -H "Content-type: application/json" 'http://localhost:3000/purchases'
  #+end_src

  #+RESULTS:
  : [{"id":1,"event_datetime":"2023-02-08T00:00:00.000Z","location":"Carrefour Osasco","comment":"","created_at":"2023-02-08T21:23:14.161Z","updated_at":"2023-02-08T21:23:14.161Z"},{"id":2,"event_datetime":"2023-02-09T12:00:00.000Z","location":"Carrefour Supershopping","comment":"abc","created_at":"2023-02-08T21:23:58.074Z","updated_at":"2023-02-08T21:23:58.074Z"}]

  #+begin_src bash :results output
    curl -XPOST -H "Content-type: application/json" 'http://localhost:3000/purchases' \
    -d '{
      "event_datetime": "2023-02-09T12:00:00",
      "location": "Carrefour Supershopping",
      "comment": "abc"
    }'
  #+end_src

  #+RESULTS:
  : {"id":2,"event_datetime":"2023-02-09T12:00:00.000Z","location":"Carrefour Supershopping","comment":"abc","created_at":"2023-02-08T21:23:58.074Z","updated_at":"2023-02-08T21:23:58.074Z"}

** Products
  #+begin_src bash :results output
    curl -XGET -H "Content-type: application/json" 'http://localhost:3000/products'
  #+end_src

  #+RESULTS:
  : [{"id":1,"name":"Galaxy A52","brand_id":1,"gtin":"710010003","photo_url":null,"created_at":"2023-01-08T00:00:00.000Z","updated_at":"2023-01-08T00:00:00.000Z"}]

  #+begin_src bash :results output
    curl -XPOST -H "Content-type: application/json" 'http://localhost:3000/products' \
    -d '{
      "name": "Iphone XR",
      "gtin": "71002233",
      "brand_id": "2"
    }'
  #+end_src

  #+RESULTS:
  : {"brand":["must exist"]}

** PurchaseProducts
  #+begin_src bash :results output
    curl -XGET -H "Content-type: application/json" 'http://localhost:3000/purchases/1/items' \
            | json_pp
  #+end_src

  #+RESULTS:
  : null

  #+begin_src bash :results output
    curl -XPOST -H "Content-type: application/json" 'http://localhost:3000/purchases/1/items' \
    -d '{
       "purchase_id": 1,
       "product_id": 100
    }'
  #+end_src

  #+RESULTS:
  : {"product":["must exist"]}
